Revit 2027 API
IFCCategoryTemplate.FindByName Method
 Returns mapping template element by name.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IFCCategoryTemplate FindByName(
	Document document,
	string name
)
Public Shared Function FindByName (
	document As Document,
	name As String
) As IFCCategoryTemplate
public:
static IFCCategoryTemplate^ FindByName(
	Document^ document,
	String^ name
)
static member FindByName :
        document : Document *
        name : string -> IFCCategoryTemplate
Parameters
document Document
 The document to find the mapping template with the specified name.
name String
 Name of the mapping template to find.
Return Value
IFCCategoryTemplate
 The mapping template element, or null if not found.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
IFCCategoryTemplate Class
Autodesk.Revit.DB Namespace